vjtagaltera/nrf52840-dongle-nus-c/main.c
        case BLE_NUS_C_EVT_NUS_TX_EVT:
            ble_nus_chars_received_uart_print(p_ble_nus_evt->p_data, p_ble_nus_evt->data_len);
            break;

        case BLE_NUS_C_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected.");
            scan_start();
            break;
    }
}
/**@snippet [Handling events from the ble_nus_c module] */


/**
 * @brief Function for handling shutdown events.
 *
 * @param[in]   event       Shutdown type.
 */
static bool shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    ret_code_t err_code;

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    switch (event)
    {
        case NRF_PWR_MGMT_EVT_PREPARE_WAKEUP:
            // Prepare wakeup buttons.
            err_code = bsp_btn_ble_sleep_mode_prepare();
            APP_ERROR_CHECK(err_code);
            break;

        default:
            break;
    }

    return true;
}

NRF_PWR_MGMT_HANDLER_REGISTER(shutdown_handler, APP_SHUTDOWN_HANDLER_PRIORITY);

/**
 * @brief Function for decoding full-name and service-uuid in adv data.
 *
 * @param[in]   type        data type to parse for.
 * @param[in]   p_advdata   pointer to input advdata.
 * @param[in]   p_typedata  pointer to output result data.
 */
#if 0
static uint32_t custom_adv_report_parse(uint8_t type, const ble_data_t * p_advdata, ble_data_t * p_typedata)
{
    uint32_t index = 0;
    uint8_t * p_data;

    VERIFY_PARAM_NOT_NULL(p_advdata);
    VERIFY_PARAM_NOT_NULL(p_typedata);

    p_data = p_advdata->p_data;
    VERIFY_PARAM_NOT_NULL(p_data);

    VERIFY_TRUE(p_advdata->len < 32, NRF_ERROR_INVALID_LENGTH); /* 31 is the max adv data */

    while (index < p_advdata->len)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type = p_data[index+1];

        if (field_type == type)
        {
            p_typedata->p_data = &p_data[index+2];
            p_typedata->len = field_length-1;
            return NRF_SUCCESS;
        }
        index += field_length+1;
    }
    return NRF_ERROR_NOT_FOUND;
}
#endif


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t            err_code;
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            err_code = ble_nus_c_handles_assign(&m_ble_nus_c, p_ble_evt->evt.gap_evt.conn_handle, NULL);
            APP_ERROR_CHECK(err_code);

            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);

            // start discovery of services. The NUS Client waits for a discovery result
            err_code = ble_db_discovery_start(&m_db_disc, p_ble_evt->evt.gap_evt.conn_handle);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_DISCONNECTED:

            NRF_LOG_INFO("Disconnected. conn_handle: 0x%x, reason: 0x%x",
                         p_gap_evt->conn_handle,
                         p_gap_evt->params.disconnected.reason);
            break;

        case BLE_GAP_EVT_TIMEOUT:
            if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
            {
                NRF_LOG_INFO("Connection Request timed out.");
            }
            break;

        case BLE_GAP_EVT_ADV_REPORT:
        {   const ble_gap_evt_adv_report_t *rpt = &p_gap_evt->params.adv_report;
            int connectable_flag = rpt->type.connectable;
            int scannable_flag   = rpt->type.scannable;
            int scanresp_flag    = rpt->type.scan_response;
            int status           = rpt->type.status;

            const ble_gap_addr_t *peer_addr = &rpt->peer_addr;
            const ble_data_t     *adv_data  = &rpt->data;

            custom_scan_sample_count ++;
            NRF_LOG_INFO("Scanning update %u ... flags %d %d %d", custom_scan_sample_count, 
                          connectable_flag, scannable_flag, scanresp_flag);
            NRF_LOG_INFO("                        "
                          "  addr %02x:%02x:%02x:%02x:%02x:%02x ",
                          peer_addr->addr[0], peer_addr->addr[1], peer_addr->addr[2], 
                          peer_addr->addr[3], peer_addr->addr[4], peer_addr->addr[5]);
            NRF_LOG_INFO("%24s  rssi %d  data %u %p",
                          " ", 
                          rpt->rssi, 
                          adv_data->len, adv_data->p_data);
            if ( status == BLE_GAP_ADV_DATA_STATUS_COMPLETE && 
                  rpt->rssi > -70 && 
                  connectable_flag && scannable_flag ) {
                if (scanresp_flag == 0) {
                    ble_data_t name_data = {0, 0};
                    //err_code = custom_adv_report_parse(BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME, 
                    //                                    adv_data, &name_data);
                    //APP_ERROR_CHECK(err_code);
                    if ( name_data.len > 0 && name_data.p_data ) {
                        NRF_LOG_INFO("%24s  found full name  data %u %p",
                                      " ", 
                                      name_data.len, name_data.p_data);
                    } else {
                        NRF_LOG_INFO("%24s  found no full name  data", " ");
                    }
                } else {
                    ble_data_t service_data = {0, 0};
                    //err_code = custom_adv_report_parse(BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_COMPLETE, 
                    //                                    adv_data, &service_data);
                    //APP_ERROR_CHECK(err_code);
                    if ( service_data.len > 0 && service_data.p_data ) {
                        NRF_LOG_INFO("%24s  found full service uuid  data %u %p  at step %u",
                                      " ", 
                                      service_data.len, service_data.p_data, 
                                      custom_scan_step);
                        #if 0
                        if ( custom_scan_step == 1 ) {
                            int match = 1;
                            for (uint32_t i=0; i<16; i++) {
                                if ( service_data.len != 16 ) {
                                    match = 0; break;
                                }
                                if ( service_data.p_data[i] != m_custom_nus_uuid128.uuid128[i] ) {
                                    match = 0; break;
                                }
                            }
                            if ( match ) {
                                //memcpy((void *)(&m_custom_nus_addr.addr[0]), &peer_addr->addr, 6);
                                //nrf_ble_scan_stop();
                                NRF_LOG_INFO("Scanning stop "
                                              "  to restart on addr %02x:%02x:%02x:%02x:%02x:%02x ",
                                              m_custom_nus_addr.addr[0], m_custom_nus_addr.addr[1], 
                                              m_custom_nus_addr.addr[2], m_custom_nus_addr.addr[3], 
                                              m_custom_nus_addr.addr[4], m_custom_nus_addr.addr[5]);
                                //custom_scan_step = 2;
                            }
                        }
                        #endif
                    } else {
                        NRF_LOG_INFO("%24s  found no full service uuid  data", " ");
                    }
                }
            }
        }
            break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported.
            err_code = sd_ble_gap_sec_params_reply(p_ble_evt->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
            // Accepting parameters requested by peer.
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
                                                    &p_gap_evt->params.conn_param_update_request.conn_params);
            APP_ERROR_CHECK(err_code);
            break;

