vjtagaltera/nrf52840-dongle-nus-c/main.c
        if ( scan_progress == 1 ) {
            if ( custom_scan_sample_count >= 30 ) {
                printf("Scanning stop on 30 samples\r\n");
                NRF_LOG_WARNING("Scanning stop on 30 samples");
                nrf_ble_scan_stop();
                scan_progress = 2;
            } else 
            if ( custom_scan_step == 2 ) {
                printf("Scanning stop on step 2\r\n");
                NRF_LOG_WARNING("Scanning stop on step 2");
                nrf_ble_scan_stop();
                scan_progress = 2;
            }
        } else if ( scan_progress == 2 ) {
            custom_scan_step = 3;
            scan_init2();
            scan_progress = 3;
            scan_start();
        } else if ( scan_progress == 3 ) {
            if ( custom_scan_sample_count >= 60 ) {
                printf("Scanning stop on 60 samples\r\n");
                NRF_LOG_WARNING("Scanning stop on 60 samples");
                nrf_ble_scan_stop();
                scan_progress = 4;
            }
        }
#if 0
        if ( custom_scan_step >= 3 && custom_scan_step <= 100 ) {
            custom_scan_step ++;
            printf("BLE UART central counting up %u.\r\n", custom_scan_step);
            NRF_LOG_INFO("BLE UART central counting up %u.", custom_scan_step);
        } else if ( custom_scan_step == 2 ) {
            custom_scan_step ++;
            printf("BLE UART central scanned.\r\n");
            NRF_LOG_INFO("BLE UART central scanned.");
        } else if ( custom_scan_step == 101 ) {
            custom_scan_step ++;
            printf("BLE UART central connecting.\r\n");
            NRF_LOG_INFO("BLE UART central connecting.");
            scan_init2();
            scan_start();
        }
#endif
    }
}
